

# TO DO List



# TODO Начисление Затрат в зависимости от даты
    # Дабавить дату Старта в Клиента в формате даты
    # TODO Страховку на начало каждых 12 месяцев
    # TODO TO каждые 6 месяцев
    # TODO Шиновонтаж Каждого 10-ого и 3-его месяца, но любой из 10-02 месяцев, если авто куплен в этот период
    # TODO Покупка Зимних покрышек Первого 10-ого месяца, но любой из 10-02 месяцев, если авто куплен в этот период


# TODO Добавить Модуль важных показателей Финансовых моделей
    # TODO Блок по Месяцам и Годам
    # TODO NPV
    # TODO WACC
    # TODO Break point


# TODO Добавить усложненный блок Кредитной линии
# TODO БЛОК CASHFLOW Finance
    # TODO Лимитированной Кредитной линии
    # TODO Кредитная линия окургленными частями с обеспечением Запаса оборотных денег


# TODO БЛОК БАЛАНСА
    # TODO Остаточная стоимость Авто для Клиента
    # TODO Остаточная стоимость Авто для Компании
    # TODO Остатки на счетах
    # TODO Остатки на Задолженности по Кредитной линии


# TODO Блок Отказа Клиента от Авто
    # TODO Остановка начислений по статусу
    # TODO Завершающие платежи Клиента
    # TODO Закрывающие затраты Компании
    # TODO Создание нового Клиента на БУ Авто


# TODO Начисление Налогов
    # TODO Начисление НДС
        # TODO НДС на Доходы
        # TODO НДС на Расходы
        # TODO НДС при Остановке Сделки
    # TODO Начисление Налога на Прибыль
        # TODO Налога на Прибыль на Основную деятельность
        # TODO Налога на Прибыль при Остановке Сделки
    # TODO Начисения на ЗП (админ затраты и т.д)



